{
  "translation": {
    "Home": "Home",
    "Projects": "Projects",
    "My Projects": "My Projects",
    "A client to play games of guess who with anime characters.": "A client to play games of guess who with anime characters. It features React+TS for the frontend, using React Router for navigation and Tailwind for styling. For the backend, it features Express as the main framework, and uses Prisma as an ORM and socket.io as websocket provider.",
    "Website": "Website",
    "A fully local PWA to keep track of incomes and spendings.": "A fully local PWA to keep track of incomes and spendings. It features Sveltekit as the frontend framework, uses the browser PWA API to allow the installation of the app and uses indexedDB to store locally all of the user's information.",
    "About Me": "About Me",
    "Full Stack Developer": "Full Stack Developer with experience in Machine Learning and Computer Science concepts",
    "education-1": "I Studied Computer Engineering in Pontificia Universidad Católica de Chile. I did courses on software engineering as well as on computer science. Some of them include Software Engineering, Advanced Web Applications, and Testing. For some of them, I was later a teacher assistant, where I graded homeworks and tests, and imparted some tutorials, depending on the course. Because of my interest on Computer Science, I decided to do a Masters, in the same university. My thesis was about using Automata to efficiently manage a streaming database. More in detail, my thesis argued about adding time window operators to the query language and evaluating the queries efficiently.",
    "education-2": "While I studied and did my masters, I worked part time as a Software Engineer at a small company for four years. My area of work there was mainly Full Stack development, and I used technologies such as ASP.Net Core, React, Flask, PostgreSQL, and services such as Azure App Service, Azure MS SQL, Github, and more. We did many experimental and innovative projects, adding machine learning to the web pages that we developed.",
    "techs": "My preferred languages are Javascript and Python. Since first year in the university, we worked with python, and since third year, with javascript. I have used these technologies in many of the projects I have made (personal and work-related). In that field, I have worked with React, Django, Flask, Express, Sveltekit. Other technologies that I am profficient in are Git, Github and Github Actions, ASP.Net Core, and many of the Azure services such as App Service, Service Bus, MS SQL, Azure Functions.",
    "soft": "I like leading people and teaching. In one hand, as a first approach, I was leading frontend developer for a course in university where we developed code for a real company. I also have leaded other projects such as a web page to manage stakeholders for a mining consultant. In the other hand I was teaching assistant for 3 years while in university, in more than 10 occasions.",
    "hobbies": "I like music and arts. My preferred types of music are Jazz and classical music (baroque and romantic specially). I play the piano for more than 10 years, that being my main instrument. Lately, I have learned to dance salsa and enjoy it a lot. I enjoy cooking and doing fancy and elaborate dishes. Finally, I also enjoy playing video games."
  }
}