{
  "translation": {
    "Home": "Inicio",
    "Projects": "Proyectos",
    "My Projects": "Mis Proyectos",
    "A client to play games of guess who with anime characters.": "Un cliente para jugar partidas de Adivina Quién con personajes de animé. Utiliza React+TS para el frontend, con la ayuda de React Router para la navegación y Tailwind para el estilo. Para el backend, utiliza Express como el framework principal, Prisma como ORM y socket.io como proveedor de websockets.",
    "Website": "Sitio Web",
    "A fully local PWA to keep track of incomes and spendings.": "Una PWA completamente local para registrar gastos y ingresos. Utiliza Sveltekit como framework frontend, usa la API PWA del navegador para permitir la instalación de la aplicación y utiliza indexedDB para guardar localmente toda la información del usuario.",
    "About Me": "Sobre Mí",
    "Full Stack Developer": "Desarrollador Full Stack con experiencia en Machine Learning y conceptos de Ciencia de la Computación",
    "education-1": "Estudié Ingeniería en Computación en la Pontificia Universidad Católica de Chile. Realicé cursos tanto de ingeniería de software como de ciencias de la computación. Algunos de ellos incluyen Ingeniería de Software, Aplicaciones Web Avanzadas y Testing. En algunos de estos cursos, más adelante fui ayudante, donde corregí tareas y pruebas, e impartí algunas cátedras, dependiendo del curso. Debido a mi interés en las Ciencias de la Computación, decidí realizar un Magíster en la misma universidad. Mi tesis se trató sobre el uso de autómatas para gestionar de manera eficiente una base de datos en streaming. Más en detalle, mi tesis abordó la incorporación de operadores de ventanas de tiempo al lenguaje de consultas y la evaluación eficiente de dichas consultas.",
    "education-2": "Mientras estudiaba y realizaba mi magíster, trabajé part-time como Ingeniero de Software en una pequeña empresa durante cuatro años. Mi área de trabajo principal fue el desarrollo Full Stack, utilizando tecnologías como ASP.Net Core, React, Flask, PostgreSQL y servicios como Azure App Service, Azure MS SQL, Github, entre otros. Realizamos muchos proyectos experimentales e innovadores, integrando machine learning a las páginas web que desarrollamos.",
    "techs": "Mis lenguajes preferidos son JavaScript y Python. Desde el primer año en la universidad trabajamos con Python, y desde el tercer año, con JavaScript. He utilizado estas tecnologías en muchos de los proyectos que he realizado (tanto personales como laborales). En ese ámbito, he trabajado con React, Django, Flask, Express y Sveltekit. Otras tecnologías en las que soy proficiente incluyen Git, Github y Github Actions, ASP.Net Core, y muchos de los servicios de Azure, como App Service, Service Bus, MS SQL y Azure Functions.",
    "soft": "Me gusta liderar equipos y enseñar. Por un lado, como un primer acercamiento, fui líder de desarrollo frontend en un curso de la universidad donde desarrollamos código para una empresa real. También he liderado otros proyectos, como una página web para gestionar stakeholders de una consultora minera. Por otro lado, fui ayudante durante 3 años en la universidad, en más de 10 ocasiones.",
    "hobbies": "Me gustan la música y las artes. Mis tipos de música preferidos son el jazz y la música clásica (especialmente del barroco y el romanticismo). Toco el piano desde hace más de 10 años, siendo este mi instrumento principal. Últimamente he aprendido a bailar salsa y lo disfruto mucho. También me gusta cocinar y preparar platos elaborados y sofisticados. Por último, disfruto jugar videojuegos."
  }
}